// створити масив та вивести його в консоль:
// з 5 числових значень
// з 5 стічкових значень
// з 5 значень стрічкового, числового та булевого типу


let num = [4, 5, 8, 10, 11]
console.log(num)

let str = ['one', 'two', 'three', 'for', 'five']
console.log(str)

let bol = [true, false]
console.log(bol)

let nsb = ['two', 8, 'for', false, 24]
console.log(nsb)

// Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль

let newMass = []
newMass.push('Привіт', 'як', 'в', 'тебе', 'справи', 2, 7, 18, true)
console.log(newMass)

// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині

for (let i = 0; i < 10; i++){
    document.write('<div>hello ok10</div>')
    document.write('</br>')
}

// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині

for (let i = 0; i < 10; i++){
    document.write(`<div>${i} hello ok10</div>`)
    document.write('</br>')
}

// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.

let i = 0;

while (i < 20){
    document.write('<h1>hello ok10</h1>');
    i++;
}

// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.

let i = 0;

while (i < 20){
    document.write(`<h1>${i} hello ok10</h1>`);
    i++;
}

// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.

let massNew = [21, 4, 5, 92, 17, 26, 7, 6, 54, 23];
for (let i = 0; i < 10; i++){
    console.log(massNew[i])
}

// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.

let massNew = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'];
for (let i = 0; i < 10; i++){
    console.log(massNew[i])
}

// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.

let massNew = ['a', 23, true, 'd', 'e', 17, false, 'h', 2, 'j'];
for (let i = 0; i < 10; i++){
    console.log(massNew[i])
}

// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи

let massNew = ['a', 23, true, 'd', 'e', 17, false, 'h', 2, 'j'];
for (let i = 0; i < 10; i++){
    if(typeof massNew[i] === 'boolean'){
        console.log(massNew[i])
    }
}

// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи

let massNew = ['a', 23, true, 'd', 'e', 17, false, 'h', 2, 'j'];
for (let i = 0; i < 10; i++){
    if(typeof massNew[i] === 'number'){
        console.log(massNew[i])
    }
}

// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи

let massNew = ['a', 23, true, 'd', 'e', 17, false, 'h', 2, 'j'];
for (let i = 0; i < 10; i++){
    if(typeof massNew[i] === 'string'){
        console.log(massNew[i])
    }
}

// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.

// ?

// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write

for (let i =0; i < 10; i++){
    console.log(i)
    document.write(i)
}

// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write

for (let i =0; i < 100; i++){
    console.log(i)
    document.write(i)
}

// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write

for (let i =0; i < 100; i+=2){
    console.log(i)
    document.write(i)
}

// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write

for (let i =2; i < 100; i+=2){
    console.log(i)
    document.write(i)
}

// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write

for (let i =1; i < 100; i+=2){
    console.log(i)
    document.write(i)
}

// - Відтворити роботу годинника, відрахувавши 2 хвилини (2 цикли! 1й - хвилини, 2й - секунди)

let hr=0;

for (let min = 0; min<=2; min++) {
    for (let sec = 0; sec < 60; sec++){
        console.log(`${hr}:${min}:${sec}`)
        if (min === 2 && sec === 0) {
            break
        }
    }
}

// - Відтворити роботу годинника, відрахувавши  2 години 20 хвилини (3 цикли! 1й - години, 2й - хвилини, 3й - секунди)

for (let hr = 0; hr < 3; hr++) {
    for (let min = 0; min < 60; min++) {
        for (let sec = 0; sec < 60; sec++) {
            document.write(`${hr}:${min}:${sec}`);
            document.write(`</br>`)
            if (hr===2 && min===20 && sec === 0) {
                break;
            }
        }

        if (hr===2 && min===20) {
            break;
        }
    }
}

// Додатково
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу while зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.

// =================
// =================
// =================
// =================

// - Дан масив ['a', 'b', 'c']. Додайте йому в кінець елементи 1, 2, 3 за допомогою циклу.

let arr = ['a', 'b', 'c']
for (i = 1; i < 4; i++){
    arr.push(i)
}

// - Дан масив [1, 2, 3]. Зробіть з нього новий масив [3, 2, 1].

let arrOne = [1, 2, 3];
arrOne = [3, 2, 1];
console.log(arrOne)

// - Дан масив [1, 2, 3]. Додайте йому в кінець елементи 4, 5, 6.

let arr = [1, 2, 3];
arr.push(4, 5, 6);
console.log(arr);

// - Дан масив [1, 2, 3]. Додайте йому в початок елементи 4, 5, 6.

let arr = [1, 2, 3];
arr.unshift(4, 5, 6);
console.log(arr);

// - Дан масив ['js', 'css', 'jq']. Виведіть на екран перший елемент за допомогою shift()

let arr = ['js', 'css', 'jq'];
document.write(arr.shift())

// - Дан масив ['js', 'css', 'jq']. Виведіть на екран останній елемент за допомогою pop()

let arr = ['js', 'css', 'jq'];
document.write(arr.pop())

// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [4, 5].
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [1,2].
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice перетворіть масив в [1, 4, 5].
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 2, 3, 'a', 'b', 'c', 4, 5].
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].
// - Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи, значення яких є парними.

let numBr = [24, 47, 3, 91, 52, 31, 10, 1, 5, 12]
for (let i = 0; i < numBr.length; i++){
    if (numBr[i] % 2 === 0){
        console.log(numBr[i])
    }
}

// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу та push () скопіювати значення одного масиву в інший

let arrOne = [24, 47, 3, 91, 52, 31, 10, 1, 5, 12];
let arrTwo = [];

for (let i = 0; i < arrOne.length; i++){
    arrTwo.push(arrOne[i])
}

console.log(arrOne)
console.log(arrTwo)

// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу скопіювати значення одного масиву в інший.


// ============

// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
// 1. перебрати його циклом while

let arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];

let i = 0;

while (i < arr.length){
    console.log(arr[i])
    i++
}

// 2. перебрати його циклом for

let arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];

for (let i = 0; i < arr.length; i++){
    console.log(arr[i])
}

// 3. перебрати циклом while та вивести  числа тільки з непарним індексом

let arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];

let i = 1;

while (i < arr.length){
    console.log(arr[i])
    i+=2
}

// 4. перебрати циклом for та вивести  числа тільки з непарним індексом

let arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];

for (let i = 1; i < arr.length; i+=2){
    console.log(arr[i])
}

// 5. перебрати циклом while та вивести  числа тільки парні  значення

let arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];

let i = 2;

while (i < arr.length){
    console.log(arr[i])
    i+=2
}

// 6. перебрати циклом for та вивести  числа тільки парні  значення

let arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];

for (let i = 2; i < arr.length; i+=2){
    console.log(arr[i])
}

// 7. замінити кожне число кратне 3 на слово "okten"

let arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];

for (let i = 0; i < arr.length; i++){
    if (arr[i] % 3 === 0){
        arr[i] = 'okten'
    }
}

console.log(arr)

// 8. вивести масив в зворотньому порядку.

let arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];

for (let i = arr.length; i >= 0; i--){
    console.log(arr[i])
}

// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
// 10
//  створити пустий масив та :
// - заповнити його 50 парними числами за допомоги циклу.

let arr = [];
for (let i = 2; i <= 100; i+=2){
    arr.push(i);
}

console.log(arr);

// - заповнити його 50 непарними числами за допомоги циклу.

let arr = []
for (let i = 1; i <= 100; i+=2){
    arr.push(i)
}

console.log(arr)


// 1
//  створити пустий масив та :
// 1. заповнити його 50 парними числами за допомоги циклу.

let arr = [];
for (let i = 2; i <= 100; i+=2){
    arr.push(i);
}

console.log(arr);

// 2. заповнити його 50 непарними числами за допомоги циклу.

let arr = []
for (let i = 1; i <= 100; i+=2){
    arr.push(i)
}

console.log(arr)

// 3. используя Math.random заполнить массив из ???(сколько хотите) элементов.

let arr = [];
for (let i = 0; i < 10; i++){
    arr.push(Math.random())
}

console.log(arr)

//  диапазон рандома 8 до 732. (но сначала пробуйте БЕЗ ДИАПАЗОНА!)

let arr = [];
for (let i = 0; i < 50; i++){
    arr.push(
        Math.floor(Math.random() * 732) + 8
    )
}

console.log(arr)

//  2. вывести на консоль  каждый третий елемент

for (let i = 3; i < arr.length; i+=3){
    console.log(arr[i])
}

//  3. вывести на консоль  каждый третий елемент
//  но при условии что его значение является парным.

for (let i = 3; i < arr.length; i+=3){
    if (arr[i] % 2 === 0){
        console.log(arr[i])
    }
}

//  4. вывести на консоль  каждый третий елемент
//  но при условии что он имеет парное значение и
//  записать их в другой массив.

let arrOne = []

for (let i = 3; i < arr.length; i+=3){
    if (arr[i] % 2 === 0){
        arrOne.push(arr[i])
    }
}

console.log(arrOne)

//  5. Вывести каждый елемент массива у которого соседний с права элемент - парный

for (let i = 0; i < arr.length; i++){
    if (arr[i] % 2 === 0){
        console.log(arr[i - 1])
    }
}

//   5 масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. обрахувати середній чек.

// 3 створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.

let arr = [24, 5, 74, 91, 24, 15];
let arrBig = [];

 for (let i = 0; i < arr.length; i++){
     arrBig.push(arr[i] * 5);
 }

 console.log(arr);
 console.log(arrBig);

// 4 створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому, і якщо об'єкт є числом,
//  додати його в інший масив.

let arrLast = [24, 'okten', true, 'js', 17, false, 24]

let arrScnd = []

for (let i = 0; i < arrLast.length; i++){
    if(typeof arrLast[i] === 'number'){
        arrScnd.push(arrLast[i])
    }
}

console.log(arrScnd)